{"meta":{"title":"Han's Blog","subtitle":111,"description":111,"author":"Han","url":"http://hanunimaas.com"},"pages":[{"title":"all-archives","date":"2017-11-19T16:33:10.260Z","updated":"2017-11-19T16:33:10.240Z","comments":false,"path":"all-archives/index.html","permalink":"http://hanunimaas.com/all-archives/index.html","excerpt":"","text":""},{"title":"all-categories","date":"2017-11-19T16:30:59.675Z","updated":"2017-11-19T16:30:59.653Z","comments":false,"path":"all-categories/index.html","permalink":"http://hanunimaas.com/all-categories/index.html","excerpt":"","text":""},{"title":"all-tags","date":"2017-11-19T16:32:56.913Z","updated":"2017-11-19T16:32:35.481Z","comments":false,"path":"all-tags/index.html","permalink":"http://hanunimaas.com/all-tags/index.html","excerpt":"","text":""}],"posts":[{"title":"Astrophotography","slug":"Astrophotography","date":"2017-11-21T11:57:00.000Z","updated":"2017-11-22T12:23:00.041Z","comments":true,"path":"2017/11/21/Astrophotography/","link":"","permalink":"http://hanunimaas.com/2017/11/21/Astrophotography/","excerpt":"This article shows you how to take photos for Milky way.","text":"TutorialFirst, here is a quick guide to astrophotography: NIGHTSCAPES A comprehensive website for astrophotography: Lonely Speck Place to trace the Milky Way in EuropeRequirements Open public space High altitude No air/light pollution Best in summer from April to September, especially in June or July Easy to approach, car rent available The requirements above, making the milky way clearly visible, are fulfilled by the following places: Recommendation place Alqueva, Portugal A nice place around a lake with no light pollution at all, totally dark. Gran Canaria and Tenerife, Spain A 3700-meter-high mountain named Teide locates in the middle of Tenerife island. Astronomic tour is available on this island. This place is also famous for a Chinese writer, Sanmao, who lived for a long time on this island. What if in winter? Try to take photos for the Constellation Orion. Equipment:Astrophotography pushes your equipment to its limits. Knowing these limits is the first step to creat great images. For the best result in your own images, familiarize yourself with the limits of your lens and camera. Test how long of a shutter duration you can use before the stars being to trail with your lens, practice visualizing your lens’s field of view before you even look through the viewfinder, and find the suitable f/number that gives you the best balance of exposure and image quality. Once you’ve fully mastered the limits of your equipment, you are only limited by your imagination. Camera: Sony α6300This article shows advantages and limits in taking astrophotograph by Sony α6000: Sony α6000 Astrophotography Review Taking astrophotograph photos by even a much smaller sensor is also possible(see the article RX100), so there’s no reason to doubt the capability of your camera. Lens:How to Pick a Lens for Milky Way Photography Sony E 16mm F2.8 + VCL-ECU This lens kit which equal to 12mm f2.8 on full frame, and 18mm f2.8 on APS-C frame, archieves 1,110 Astro Lens Score, representing the super imaging quality by aboving the criteria of 1000 for an excellent lens. Sigma 30mm F1.4 DC DN | Contemporary On APS-C frame it is a standard lens with focal length at 45mm. Although the angle is not wide enough, the super clear aperture shows the possibility to capture enough light in a short time without letting the stars start trailing. However, the right way to use the standard lens is to take more than one photo with at least 50 percent overlapped in between, and then merge the photos into a panorama picutre in post processing procedures. Medium Format Astrophotography with Panorama Stitching Setting the right parameters Shoot in RAW Zoom out Manual focus Manual exposure Enable long exposure noise reduction Enable the histogram Use automatic white balance For the lens 16mm f2.8 with wide range adapter: Of course first to fully open the aperture. Second, in order to get rid of stars being to trail, the exposure time should be no more than 25s or 30s. Under this circumstance, what we can still control is the ISO. Evidence shows that cameras with the ability of ISO invariance can take the photo in low ISO and then push the exposure in post processing without hurting the image quality. f/2.8 28s ISO 3200 The parameters above is extrapolated in stops from a “standard”(there’s no standard actual standard…) Milky Way exposure of: 30s, f/2.0, ISO 1600. Post processingArticle: Hwo to Process Milky Way Astrophotography in Adobe Lightroom Noise Reduction with Image Stacking Milky Way Exposure Stacking with manual Alighment in Adobe Photoshop Removing Coma Aberration in Adobe Photoshop: Astrophotography Tutorial","categories":[{"name":"Photography","slug":"Photography","permalink":"http://hanunimaas.com/categories/Photography/"}],"tags":[]},{"title":"《极致之美》——基础篇","slug":"yunman-photography-2","date":"2017-11-19T18:41:37.000Z","updated":"2017-11-21T12:04:58.012Z","comments":true,"path":"2017/11/19/yunman-photography-2/","link":"","permalink":"http://hanunimaas.com/2017/11/19/yunman-photography-2/","excerpt":"摄影器材和设备机身相对于大画幅和中画幅数码后背而言，135全画幅数码相机是画质、便携性和价格的完美结合点。另外，APS-C画幅具有体积小，价格相对低廉的特点，虽然高感相比全画幅差距较大，但也基本能满足多数业余爱好者的需要。","text":"摄影器材和设备机身相对于大画幅和中画幅数码后背而言，135全画幅数码相机是画质、便携性和价格的完美结合点。另外，APS-C画幅具有体积小，价格相对低廉的特点，虽然高感相比全画幅差距较大，但也基本能满足多数业余爱好者的需要。 镜头变焦镜头比定焦镜头更方便，这一点在风光摄影中显得格外重要。 超广角镜头（11~35mm） 风光摄影师主力镜头，能收下更多场景，而且还能强调前景，建立视觉纵深感。 广角和中焦镜头（35~70mm） 人文摄影师最喜欢的焦段。于风光摄影中，可以不用选择大口径光圈镜头，因为风光摄影通常只用f/8以下的光圈。 中长焦镜头（70mm以上） 可简化画面，获得干净的构图。此外，长焦镜头能压缩空间，让画面显得比较平面抽象。此焦段常用于拍摄风光小品。考虑风光摄影常用光圈，体积，价格等因素，此类镜头依然不建议购买大口径光圈镜头。 特殊题材 星空摄影需要大光圈（f/2.8以下）和超广角镜头。24mm有可能不够广，需要多张拼接。移轴镜头对建筑摄影师是不可或缺的，在风光摄影中可以避免透视变形，还能实现无变形拼图。 支撑系统和其他附件 三脚架 三脚架的重要性不言而喻，这是每个严肃的风光摄影师绝不妥协的一环。运用好三脚架一方面可避免相机抖动，另一方面可帮助摄影师仔细研究构图，静下心来检查画面中的所有细节。 云台 一个好的云台除稳定器材外，还有助于全景接片，球形云台操作起来比较快捷，使用率广。 快装板 每一部机身和长焦镜头上都应该装有快装板，以方便更换机身镜头等。L形快装板可使竖排接片变得更方便。 滤镜系统 现代数码摄影多用曝光合成技术代替渐变镜。ND和CPL是目前还没法取代的两种滤镜。虽然多次曝光加堆栈技术可以在一定程度上模仿ND镜效果，但是局限性太大，拍摄浪花等动态场景没有ND效果好，后期处理也比较费力。 此外还有摄影包，闪光灯等。 户外装备GPS，卫星通讯设备，登山杖，头等，帐篷，睡袋，烹饪装备(MSR Pocket Rocket)，急救包，防熊喷雾等…… 摄影app PlanIt! Pro: 可查看日出日落，月生月落，银河位置等等。还可以查看在地球上哪个位置的某一时刻会有物体挡住我们感兴趣的天体。 PlanIt!教学视频 DOF Calculator: 景深计算程序。 Northern Eye: 预测北极光。 计算机在处理图像数据中，CPU和内存相对比较重要。此外，用NAS组磁盘阵列是确保数据安全的最好方式。任何时候，一定要保证图像数据至少有两份相同的拷贝位于不同的存储设备中。 MacOS用户可以考虑使用Time Machine备份软件。Windows用户可以使用Allway Sync。 此外，异地存储是大型公司一定会采用的策略，可应对火灾、自然灾害等意外。设备有价，照片无价。专业摄影师可考虑以此种方式备份和管理数据。 数码摄影后期的基本概念文件格式应以raw格式拍片，方便后期。raw格式可无损调整白平衡，在不过曝的情况下后期减少曝光并不会损害画质。虽然对raw文件增加曝光会增加噪点，但是对现代多数相机来说，特别是对白天光线好的场景增加曝光，噪点和画质劣化在可以接受的范围内。 jpeg格式：通常用于普通旅游者拍“到此一游”、抢时间出片的新闻记者、以及影室或照相馆中专业摄影师——在灯光精确控制的情况下，可直接jpeg出片。 tiff格式：无损压缩，16位存储，还可以包括图层。在raw文件解码后并进行进一步后期调整时首选的格式。 色深使用16位RGB文件存储图像，以获得更多的色彩变化。特别是在天空、水面等色阶平滑过渡的地方，很多时候只要稍微加一点反差或者拉一点曲线就会出现色彩断层，此时16位文件可以有效缓解或避免这一问题。打印输出或用于网络浏览的时候，出于兼容性以及文件大小考虑，可改为8位RGB文件。 软件解码raw文件，原厂软件最准，但功能有限。 一般的方法是使用Lightroom管理影像，对影像进行基本的调整。之后使用Photoshop进行复杂的后期调整。 工作流拍摄——导入计算机——Lightroom处理——Photoshop处理——缩小或插值放大输出 ISO不变性如果一台相机提高ISO和后期提亮raw画面，对画质的损害如果几乎等同的话，称这台相机具有ISO不变性（ISOless或者ISOInvariance）。现代数码相机，特别是索尼传感器的相机，比如索尼，尼康，宾得等，基本已具有ISO不变性。利用相机这个性质，可以在条件所限下（比如没有三脚架的情况下）先用尽量低的ISO和防抖进行手持拍摄，或者用低ISO保持画面高光不过曝，然后通过后期提亮画面暗部，结果通常要好于直接增加ISO进行拍摄所得到的效果。在拍摄星空和银河的时候该方法同样有用：星星具有丰富的颜色，用高ISO拍摄（ISO3200/6400, F/2.8, 30s）可能会过曝，前提欠曝后期提亮可避免这个问题。","categories":[{"name":"Photography","slug":"Photography","permalink":"http://hanunimaas.com/categories/Photography/"}],"tags":[]},{"title":"《极致之美》——思考篇","slug":"yunman-photography-1","date":"2017-11-19T17:32:52.000Z","updated":"2017-11-20T09:17:52.026Z","comments":true,"path":"2017/11/19/yunman-photography-1/","link":"","permalink":"http://hanunimaas.com/2017/11/19/yunman-photography-1/","excerpt":"摄影中的主观创造一幅照片，展示的是摄影师想让你看到的角度。这个时间和空间的截片，不是简单地对真实世界的记录和如明信片的景点介绍，而是情绪的表达，是摄影师心中的风景。它强调的是按下快门那一瞬间最能打动摄影师内心的景物，也是摄影师的创造力和艺术沉淀的综合体现。拍摄显而易见的客观景物本身只是记录和搬运美景，发现摄影师独特的主观视角才是艺术创作。","text":"摄影中的主观创造一幅照片，展示的是摄影师想让你看到的角度。这个时间和空间的截片，不是简单地对真实世界的记录和如明信片的景点介绍，而是情绪的表达，是摄影师心中的风景。它强调的是按下快门那一瞬间最能打动摄影师内心的景物，也是摄影师的创造力和艺术沉淀的综合体现。拍摄显而易见的客观景物本身只是记录和搬运美景，发现摄影师独特的主观视角才是艺术创作。 那些很容易到达的地方，比如已经修好的观景台等，你在这里拍摄，别人也可以很容易在这里拍摄。此为旅游者视角，这本身并没有什么错。人们在一个地方修观景台的原因，多半是因为从那个角度看风景的角度最佳，或者该地点较容易到达。一个摄影师的作品集里有一些这样的“经典构图”是完全合理的。然而，摄影师要突破常规，需要多观察，多走动，去别人不曾到过的地方，以别人不曾观察到的角度拍摄，这样才可以拍摄出属于自己的照片。 而世之奇伟、瑰怪，非常之观，常在于险远，而人之所罕至焉，故非有志者不能至也。 ——《游褒禅山记》 还有一些人错误的认为，他们没有拍到好照片，是因为自己的相机不够好，或者因为自己没有机会去这些地方，他们把问题都归结于客观原因。其实这是错误的。虽然器材对于摄影来说确实是重要的一环，但拿着好器材拍出烂照片的例子比比皆是。好的器材只有在高手的手中才能彻底发挥它的优势。一把顶级的小提琴，放在不懂音乐的人的手中，拉出来的声音注定只能是噪音。此外，陌生以及壮丽的场景，确实能激发人的观察力和创作欲。然而，世上那些著名景点每天都有成千上万人去游览，每人用手机随便一拍就应该是大片，可现实并不都是这样。比到达一个绝美地方更重要的是，我们必须有一双发现美的眼睛，以及展现这些美的技术手段。 英国著名摄影师David Norton在他的《等待光纤》一书中说道： 这种广为流传的错误想法是一个很容易掉进去的陷阱——相信如果自己随便到了某个壮丽的地方就足够了，在哪里拍摄大片就像从树上摘下成熟的果实那样简单。但事实上，真正独特、引人入胜、令人惊叹、细致入微和惟妙惟肖的照片是“造”出来的，而不是“照”出来的。他们是思维的产物，是通过坚持不懈的努力和熟练的技术将想像变为现实。 风光摄影的几个阶段 技术上过关，曝光准确，对焦清晰。 讲究构图和色彩。 去到风景名胜，等待光线，模仿经典构图。 若遇到绝佳天气，可能还会拍得比原版还好看。对绝大多数摄影爱好者，甚至很多专业摄影师来说，第三条就是最高境界了。 在经典机位模仿前人作品是很好的学习机会，几乎每个人都会经历这个阶段。而摄影师应追求进一步的提高，在作品里表现出自己个人的视角、情感和艺术风格，拍摄属于摄影师“自己”的照片。独特和新颖，是大多数风光摄影师们所追求的最高阶段。 小景物，大风光当代主流风光摄影主要表现自然界壮丽、宏伟、辽阔的大风光。运用广角镜头，重视前景微小细节，结合近景小品和大风光的思路，称为“小景物，大风光”。拍摄这样的照片需要： 敏锐的观察力和创造力 很强的组织画面元素的功力 技术上的景深合成 超广角图像中常见的过渡： 前景冷色调与远景暖色调（落日） 前景低饱和与远景高饱和 前景暗色调与远景亮色调 前景清晰远景模糊 运用好画面中的过渡，可塑造影像强烈的三维透视感。 总结 我们不只是用相机拍照，我们带到摄影作品中去的是所有我们读过的书、看过的电影、听过的音乐、走过的路和爱过的人。 摄影离不开客观现实，但一幅优秀的作品中更包含了摄影师的主观创造。任何强调客观，忽略主观的想法都有失偏颇。我们拍摄的是客观风景，但反映出的其实是摄影师自己的主观内心。","categories":[{"name":"Photography","slug":"Photography","permalink":"http://hanunimaas.com/categories/Photography/"}],"tags":[]},{"title":"R语言学习（三）矩阵","slug":"R-programming-3","date":"2017-11-15T19:23:41.017Z","updated":"2017-11-20T10:46:07.550Z","comments":true,"path":"2017/11/15/R-programming-3/","link":"","permalink":"http://hanunimaas.com/2017/11/15/R-programming-3/","excerpt":"第三章——矩阵 矩阵是一种特殊的向量，包含两个附加的属性：行数和列数。矩阵是数组的特例，数组可以大于两维，而矩阵只有两维。","text":"第三章——矩阵 矩阵是一种特殊的向量，包含两个附加的属性：行数和列数。矩阵是数组的特例，数组可以大于两维，而矩阵只有两维。 创建矩阵矩阵相当于按列存储一个向量，但是实际也存在矩阵类(matrix class)。其中nrow或者ncol只给出一个参数也可以创建向量。 &gt; y &lt;- matrix(c(1:4), nrow = 2, ncol = 2)&gt; y [,1] [,2][1,] 1 3[2,] 2 4&gt; which(y&gt;2) #矩阵的按列存储性质[1] 3 4&gt; class(y)[1] \"matrix\"&gt; attributes(y)$dim[1] 2 2 或者先创建矩阵： &gt; y &lt;- matrix(nrow = 2, ncol = 2) 再为每一个元素赋值：y[1,1] &lt;- 1… 也可以对矩阵的子矩阵进行赋值，假设y行数大于3： y[c(1,3),] &lt;- matrix(c(1,1,8,12), nrow = 2) 此外，还可以用rownames()和colnames()给矩阵的行和列命名： &gt; colnames(y) = c('a','b')&gt; y a b[1,] 1 3[2,] 2 4 用nrow()和ncol()访问矩阵的行数和列数。 矩阵运算加减乘除矩阵乘法（线性代数意义上的乘法） &gt; y %*% y [,1] [,2][1,] 7 15[2,] 10 22 y*3代表矩阵每个元素都乘以3，而y+y代表矩阵每个位置对应的元素相加。 矩阵元素筛选&gt; x &lt;- matrix(c(1:6), nrow = 3)&gt; x [,1] [,2][1,] 1 4[2,] 2 5[3,] 3 6&gt; x[x[,2] &gt;= 5,] [,1] [,2][1,] 2 5[2,] 3 6&gt; 先选出矩阵第二列大于5的元素，然后再将布尔向量应用到原矩阵中，选择出第2和3行。 另外一种选择方法： &gt; x[x[,1] &gt; 1 &amp; x[,2] &gt; 5,][1] 3 6&gt; x[,1]&gt;1[1] FALSE TRUE TRUE&gt; x[,2] &gt; 5[1] FALSE FALSE TRUE&gt; x[,1] &gt; 1 &amp; x[,2] &gt; 5[1] FALSE FALSE TRUE 用“与”运算符&amp;从矩阵中选出了第一列大于1并且第二列大于5的部分。 要注意的是，如果只从矩阵提取一行，会自动变成向量。若仍想保留矩阵属性，需要使用drop参数。 &gt; dim(x)[1] 3 2&gt; dim(x[,1]) #此时已经成为向量，没有dim属性NULL&gt; dim(x[,1, drop = F])[1] 3 1 也可以用as.matrix()将向量转化为矩阵。 返回矩阵某元素的位置使用row()和col()函数查看矩阵中某元素的位置。在某些特殊情况下会用到，比如创建对称矩阵时： &gt; m &lt;- matrix(nrow = 4, ncol = 4)&gt; m &lt;- ifelse(row(m) == col(m), 1, 0.2)&gt; m [,1] [,2] [,3] [,4][1,] 1.0 0.2 0.2 0.2[2,] 0.2 1.0 0.2 0.2[3,] 0.2 0.2 1.0 0.2[4,] 0.2 0.2 0.2 1.0&gt; row(m) [,1] [,2] [,3] [,4][1,] 1 1 1 1[2,] 2 2 2 2[3,] 3 3 3 3 可以使对角线元素为1，其余元素为0.2。 apply函数apply(m, dimcode, f, fargs) m为矩阵。 dimcode = 1按行应用函数，dimcode = 2按列应用函数。 f是函数。 fargs是函数的参数。如果所调用的函数的返回值是一个包含k个元素的向量，那么apply()的结果就有k行。有时会引起矩阵的行列数的变化，需要运行后dim检查一下结果。 插入或删除矩阵的行或列向量直接使用c()插入： &gt; x = c(1:7)&gt; x = c(x[1:3], 20, x[4:7])&gt; x[1] 1 2 3 20 4 5 6 7 矩阵使用cbind()和rbind()插入列和行。然而通过这两个函数若用于循环创建矩阵比较耗时，所以最好的办法是先定义好一个大矩阵然后再循环赋值。 想要删除矩阵的行或列，可以通过重新索引矩阵某一部分的方式，或者比如使用c(-1)索引行或列今儿删除矩阵的第一行或列。 高维数组一个简单的例子，通过两个矩阵组成高维数组： &gt; x &lt;- matrix(c(1:12), nrow = 3)&gt; y &lt;- matrix(c(24:13), nrow = 3)&gt; x [,1] [,2] [,3] [,4][1,] 1 4 7 10[2,] 2 5 8 11[3,] 3 6 9 12&gt; y [,1] [,2] [,3] [,4][1,] 24 21 18 15[2,] 23 20 17 14[3,] 22 19 16 13&gt; tests &lt;- array(data = c(x, y), dim = c(3,4,2)) #创建高维数组，其中dim中的2代表数据共有两层(两个矩阵组成)&gt; dim(tests) #维度由三个元素构成[1] 3 4 2&gt; tests, , 1 [,1] [,2] [,3] [,4][1,] 1 4 7 10[2,] 2 5 8 11[3,] 3 6 9 12, , 2 [,1] [,2] [,3] [,4][1,] 24 21 18 15[2,] 23 20 17 14[3,] 22 19 16 13&gt; tests[3,2,1] #返回第一个矩阵中的第三行第二列的元素[1] 6","categories":[{"name":"R programming","slug":"R-programming","permalink":"http://hanunimaas.com/categories/R-programming/"}],"tags":[]},{"title":"R语言学习（二）向量","slug":"R-programming-2","date":"2017-11-01T20:49:12.000Z","updated":"2017-11-20T10:47:25.884Z","comments":true,"path":"2017/11/01/R-programming-2/","link":"","permalink":"http://hanunimaas.com/2017/11/01/R-programming-2/","excerpt":"第二章——向量 向量是R语言中最基础也是最常用的数据结构。","text":"第二章——向量 向量是R语言中最基础也是最常用的数据结构。 向量性质可以用c()添加和合并向量。矩阵为按列存储的向量。尽量避免使用for(i in 1:inlength(x))在循环中，因为length(x)有可能为0： &gt; x &lt;- c()&gt; xNULL&gt; 1:length(x)[1] 1 0 声明向量向量不需要声明，可以直接赋值。先创建向量再赋值的例子： &gt; y &lt;- vector(length=2)&gt; y[1] FALSE FALSE&gt; y[1] &lt;- 5&gt; y[2] &lt;- 12&gt; y[1] 5 12 循环补齐在对两个向量运算时，如果要求这两个向量具有相同长度，则较短的向量会被循环补齐: &gt; c(1,2,4) + c(6,0,9,20,22)[1] 7 2 13 21 24Warning message:In c(1, 2, 4) + c(6, 0, 9, 20, 22) : longer object length is not a multiple of shorter object length 等同于c(1,2,4,1,2) + c(6,0,9,20,22) 常用向量运算*为元素与元素相乘: &gt; c(1,2,4) * c(5,0,-1)[1] 5 0 -4 负号用于删除元素，删除最后一个元素用length(): &gt; z &lt;- c(5,12,13)&gt; z[-1][1] 12 13&gt; z[-1:-2][1] 13&gt; z[1:(length(z)-1)][1] 5 12 运算符优先级问题: &gt; 1:2-1[1] 0 1&gt; 1:(2-1)[1] 1 seq()创建向量: &gt; seq(from=12, to=30, by=3)[1] 12 15 18 21 24 27 30&gt; seq(from=1.1, to=2, length=10) [1] 1.1 1.2 1.3 1.4 1.5 1.6 1.7 1.8 1.9 2.0 rep()创建向量: &gt; rep(1:3,2)[1] 1 2 3 1 2 3&gt; rep(1:3,each=2)[1] 1 1 2 2 3 3 使用all()和any()&gt; x &lt;- 1:10&gt; any(x&gt;8)[1] TRUE&gt; all(x&gt;8)[1] FALSE 计算向量累积和cumsum(): &gt; cumsum(1:10) [1] 1 3 6 10 15 21 28 36 45 55 向量化运算符假设我们希望对向量x中每一个元素使用函数f()，很多情况下对x调用f()就可以完成。提高R代码执速度的有效方法之一是向量化，这意味着应用到向量上的函数实际上应用在其每一个元素上: &gt; w &lt;- function(x) return(x+1)&gt; w(c(5,2,8))[1] 6 3 9&gt; sqrt(1:8)[1] 1.000000 1.414214 1.732051 2.000000 2.236068 2.449490 2.645751 2.828427 sapply(x,f)对x的每一个元素使用函数f()，并将结果转化为矩阵: &gt; z12 &lt;- function(z) return(c(z,z^2))&gt; sapply(1:8, z12) [,1] [,2] [,3] [,4] [,5] [,6] [,7] [,8][1,] 1 2 3 4 5 6 7 8[2,] 1 4 9 16 25 36 49 64 缺失值NA与NULLNA代表存在，但是缺失；NULL代表空，不存在: &gt; x &lt;- c(1,NA,3)&gt; mean(x)[1] NA&gt; mean(x, na.rm=T)[1] 2&gt; x &lt;- c(1,NULL,3)&gt; mean(x)[1] 2&gt; x[1] 1 3&gt; mode(x[1])[1] \"numeric\"&gt; mode(x[2])[1] \"numeric\" NULL可以初始化向量： &gt; z &lt;- NULL&gt; c(z,3)[1] 3&gt; z &lt;- NA&gt; c(z,3)[1] NA 3 注意：NULL是R的一种特殊对象，它没有模式。 筛选使用运算符(比如&gt;)返回的布尔值向量对向量元素进行筛选&gt; z &lt;- c(5,2,-3,8)&gt; j &lt;- z*z &gt; 8&gt; j[1] TRUE FALSE TRUE TRUE&gt; y &lt;- c(1,2,30,5)&gt; y[j][1] 1 30 5 另一个例子： &gt; x &lt;- c(1,3,8,2,20)&gt; x[x &gt; 3] &lt;- 0&gt; x[1] 1 3 0 2 0 使用subset()函数进行筛选可以处理缺失值NA： &gt; x &lt;- c(6,1:3,NA,12)&gt; x[x &gt; 5][1] 6 NA 12&gt; subset(x, x &gt; 5)[1] 6 12 使用which()函数找到满足条件元素所在的位置&gt; z &lt;- c(5,2,-3,8)&gt; which(z*z &gt;8)[1] 1 3 4&gt; which(z*z &gt;8)[1] #找到满足条件元素首次出现的位置[1] 1 向量化的ifelse()函数ifelse(b,u,v)如果b[i]为真，则返回值的第i个元素为u[i]，否则为v[i]： &gt; x &lt;- c(5,2,9,12)&gt; ifelse(x &gt; 6, 2*x, 3*x)[1] 15 6 18 24 diff()函数比较向量每个元素和后面的元素之差， sign()函数将向量中的数值转化为1、0或者-1： &gt; u &lt;- c(1,6,7,2,3,5)&gt; diff(u)[1] 5 1 -5 1 2&gt; sign(diff(u))[1] 1 1 -1 1 1 测试向量相等使用all()函数： &gt; x &lt;- 1:3&gt; y &lt;- c(1,2,4)&gt; x == y[1] TRUE TRUE FALSE&gt; all(x == y)[1] FALSE 符号:产生的是整数，而c()产生的是浮点数，identical(x,y)判断两个对象是否完全一样： &gt; x &lt;- 1:2&gt; y &lt;- c(1,2)&gt; all(x == y)[1] TRUE&gt; identical(x,y)[1] FALSE&gt; typeof(x)[1] \"integer\"&gt; typeof(y)[1] \"double\" 向量元素的名称使用name()给向量中的元素命名，或查询向量元素名称： &gt; x &lt;- 1:3&gt; x[1] 1 2 3&gt; names(x) &lt;- c(\"a\",\"b\",\"ab\")&gt; names(x)[1] \"a\" \"b\" \"ab\"&gt; x a b ab 1 2 3 &gt; x[\"b\"]b 2 c()的强制类型转换&gt; c(5,2,\"abc\")[1] \"5\" \"2\" \"abc\"&gt; c(5,2,c(1.5,6))[1] 5.0 2.0 1.5 6.0","categories":[{"name":"R programming","slug":"R-programming","permalink":"http://hanunimaas.com/categories/R-programming/"}],"tags":[]},{"title":"Running Lemon-Tree on Arg1.CD68-correlated Modules","slug":"run-lemon-tree","date":"2017-10-26T13:30:05.000Z","updated":"2017-11-20T10:20:35.167Z","comments":true,"path":"2017/10/26/run-lemon-tree/","link":"","permalink":"http://hanunimaas.com/2017/10/26/run-lemon-tree/","excerpt":"This is to show how to run Lemon-Tree algorithm on our dataset.","text":"This is to show how to run Lemon-Tree algorithm on our dataset. Data For WGCNA: transcriptomics data with stable patients, same classification as Jan’s version. For Lemon-Tree: transcriptomics data with 7 modules on all patients. See the file arg1.cd68.stable.pdf. Modules: indianred3, lightslateblue, brown4, mediumpurple4, orangered1, yellowgreen, firebrick4. Preprocess: Scale the feature to standard normal distribution before running the Lemon-Tree program. Procedure From WGCNA results on stable patients, select 7 interesting modules (5 positive correlation, 2 negative correlation to Arg1.CD68) including 1645 unique genes. From 1645 genes select candidate regulators according to GO annotation. 205 candidates were selected.GO:0004871, signal transducer activityGO:0000989, transcription factor activity, transcription factor binding Run Lemon-Tree on the 1645 genes with all stable and unstable patients. Clustering result of Lemon-Tree includes 36 clusters with 1456 genes. Assign 205 candidate regulators on 36 clusters. 100 highest assignments were selected. 35 of all clusters have regulators. 74 unique regulators were selected.Frequency of regulators occurred more than one time: BRD7(3), ENY2(2), EVI2A(3), GPR65(3), GRN(4), HEYL(6), LANCL1(2), MAP4K4(2), NMI(3), RERE(2), ROR(2), SETD3(2), SS18L2(2), TGFB1I1(2), TOB1(2) GO enrichment analysis on the 35 clusters. Trace the genes back from WGCNA modules. Most of the genes gathering in one Lemon-Tree cluster are also belong to one WGCNA module. Calculate the genes to WGCNA eigengene. Regulator genes tend to have higher correlation to the corresponding WGCNA eigengene. Possible Improvements Check the regulators which regulate more than one cluster. Check the GO results to find interesting clusters. Add miRNA as regulators. Variables in R transcriptomics.stable #WGCNA data moduleColors.stable #WGCNA modules regulators.old # GO:0004871 &amp; GO:0000989 genes stable.arg1.modules #7 interesting modules stable.arg1.genes #selected genes from 7 modules arg1.transcriptomics.stableandunstable.scaled #scaled data for Lemon-Tree, 1645 genes ID.nodup/arg1.transcriptomics.IDs #ID information arg1.regulators.old #candidate regulators for 7 modules tight.clusters.su #Lemon-Tree clustering result, 1456 genes top.regs.su.old #top 100 regulator assignments reg.list.su.old #regulator list for output reg.gene.list.su.old $regulator and gene list for output Lemon Tree程序的基本步骤ganesh通过gibbs sampling进行双向聚类： 随机分配N个gene到K0个类，随机分配M个样本到Lk,0个样本类。 N次循环，从某类中随机删除gene i，对每个类，以及i单独成为一类的情况，计算将i放入k中的贝叶斯概率。 经过n次迭代得到稳定的聚类结果。 tight_clusterregulators注意事项首先要标准化 scale features 其次要选择candidate regulator genes from GO annotation 相关文献 References Segal E, Shapira M, Regev A, Pe’er D, Botstein D, et al.(2003) Module networks: identifying regulatory modules and their condition-specific regulators from gene expression data. Nature Genetics 34: 166–167. Bonnet E, Calzone L, Michoel T. (2015) Integrative multi-omics module network inference with Lemon-Tree. PLoS Comput Biol 11(2): e1003983. Joshi A, Van de Peer Y, Michoel T (2008) Analysis of a Gibbs sampler for model based clustering of gene expression data. Bioinformatics 24: 176–183. Joshi A, De Smet R, Marchal K,Van de Peer Y, Michoel T( 2009) Module networks revisited: computational assessment and prioritization of model predictions. Bioinformatics 25: 490- 496.","categories":[{"name":"Research","slug":"Research","permalink":"http://hanunimaas.com/categories/Research/"}],"tags":[]},{"title":"R语言学习（一）入门","slug":"R_programming_1","date":"2017-10-26T07:16:27.000Z","updated":"2017-11-20T10:41:41.805Z","comments":true,"path":"2017/10/26/R_programming_1/","link":"","permalink":"http://hanunimaas.com/2017/10/26/R_programming_1/","excerpt":"R语言免费，开源，语法简单，适合从事数学、统计学等非计算机人员学习使用。此文以一个计算机专业人员的角度学习和使用R语言。","text":"R语言免费，开源，语法简单，适合从事数学、统计学等非计算机人员学习使用。此文以一个计算机专业人员的角度学习和使用R语言。 运行R程序交互模式&gt; source(\"z.R\") 批处理模式(ubuntu terminal)$ R CMD BATCH z.R R语言函数的变量作用域局部变量只有函数体内部可见的变量是“局部变量” &gt; x &lt;- 5&gt; f &lt;- function() x &lt;-4&gt; f()&gt; x[1] 5 全局变量全局变量是在函数之外创建的变量，在函数内部也可以访问。可以通过&lt;&lt;-在函数内部给全局变量赋值 &gt; y &lt;- 4&gt; f &lt;- function(x) y &lt;&lt;- 3&gt; f()&gt; y[1] 3 默认参数&gt; g &lt;- function(x, y=2, z=T)&#123;...&#125; R语言的数据结构1. 向量 Vector向量是R语言的核心。一个向量内部的数据类型是单一的，不可以由整数元素和字符串混合构成。在R语言中即使单个的数实际上也是由向量所表示的 &gt; x &lt;- 8&gt; x[1] 8 2. 字符串 Character&gt; y &lt;- \"abc\"&gt; y[1] \"abc\"&gt; length(y)[1] 1 字符串连接与分割使用paste连接字符串，用strsplit分割字符串 &gt; u &lt;- paste(\"abc\", \"de\", \"f\")&gt; u[1] \"abc de f\"&gt; v &lt;- strsplit(u, \" \")&gt; v[[1]][1] \"abc\" \"de\" \"f\" &gt; v[[1]][1] \"abc\" \"de\" \"f\" &gt; 3. 矩阵 Matrix也可以理解为按列存放的向量 &gt; m &lt;- rbind(rnorm(2), rnorm(2))&gt; m [,1] [,2][1,] 0.07614777 0.26227249[2,] 0.81721921 0.05898863&gt; m[3][1] 0.2622725&gt; 4. 列表 List创建列表&gt; x &lt;- list(u = 2, v = \"abc\")&gt; x$u[1] 2$v[1] \"abc\"&gt; x$u[1] 2 列表作为函数返回值&gt; hn &lt;- hist(Nile)&gt; hn$breaks [1] 400 500 600 700 800 900 1000 1100 1200 1300 1400$counts [1] 1 0 5 20 25 19 12 11 6 1$density [1] 0.0001 0.0000 0.0005 0.0020 0.0025 0.0019 0.0012 0.0011 0.0006 0.0001$mids [1] 450 550 650 750 850 950 1050 1150 1250 1350$xname[1] \"Nile\"$equidist[1] TRUEattr(,\"class\")[1] \"histogram\" 注意attr后面的内容，标志了hn的属性histogram也可使用str()输出列表，更为直观 &gt; str(hn)List of 6 $ breaks : int [1:11] 400 500 600 700 800 900 1000 1100 1200 1300 ... $ counts : int [1:10] 1 0 5 20 25 19 12 11 6 1 $ density : num [1:10] 0.0001 0 0.0005 0.002 0.0025 0.0019 0.0012 0.0011 0.0006 0.0001 $ mids : num [1:10] 450 550 650 750 850 950 1050 1150 1250 1350 $ xname : chr \"Nile\" $ equidist: logi TRUE - attr(*, \"class\")= chr \"histogram\" 5. 数据框 Data Frame实际上是列表，只不过每个列表存储着一列向量。data.frame通常通过读取文件来创建，此处不再举例。 6. 类 ClassR语言是一门面向对象的编程语言。每一个对象都有其类别属性，R语言的泛型函数可以根据变量的类别来执行。通过class()查看变量的类 &gt; hn &lt;- hist(Nile)&gt; class(hn)[1] \"histogram\" 通过attributes()查看变量的属性，可以直接使用属性(变量)语句 &gt; attributes(hn)$names[1] \"breaks\" \"counts\" \"density\" \"mids\" \"xname\" \"equidist\"$class[1] \"histogram\"&gt; names(hn)[1] \"breaks\" \"counts\" \"density\" \"mids\" \"xname\" \"equidist\" 总结变量（对象）的类型&gt; m &lt;- rbind(rnorm(2), rnorm(2))&gt; m [,1] [,2][1,] 0.07614777 0.26227249[2,] 0.81721921 0.05898863&gt; typeof(m)[1] \"double\"&gt; mode(m)[1] \"numeric\"&gt; attributes(m)$dim[1] 2 2&gt; class(m)[1] \"matrix\" 清空环境变量rm(list = ls())","categories":[{"name":"R programming","slug":"R-programming","permalink":"http://hanunimaas.com/categories/R-programming/"}],"tags":[]},{"title":"博士学习计划","slug":"study_plan","date":"2017-10-25T06:39:22.000Z","updated":"2017-11-21T19:25:10.802Z","comments":true,"path":"2017/10/25/study_plan/","link":"","permalink":"http://hanunimaas.com/2017/10/25/study_plan/","excerpt":"毕业之前应当要完成的事。","text":"毕业之前应当要完成的事。 应掌握的技能 精通R语言，以计算机专业人员而非统计学家那样使用R语言。 掌握spark分布式计算，学习scala，具备分布式编程能力。 追踪最新的机器学习算法，比如深度学习和神经网络等，学习CUDA。 应发表的文章 一作SCI： 3-5篇，应有1-2篇高质量文章 非一作SCI： 若干 目前一篇Nature Communications在投。 在美国的顶级实验室实习备选top lab： Havard University(哈佛大学) Northeastern University(东北大学): Barabási Lab 应去国家 已去过：英国、法国、德国、美国、荷兰、比利时、意大利、西班牙、葡萄牙、奥地利、瑞典、丹麦、卢森堡、土耳其、匈牙利、斯洛伐克、斯洛文尼亚、罗马尼亚、梵蒂冈、摩纳哥、新加坡、印度尼西亚、 将来要去：摩洛哥、希腊、俄罗斯、芬兰、爱沙尼亚、拉脱维亚、立陶宛、波兰、挪威、冰岛、保加利亚、克罗地亚、塞尔维亚、阿根廷、南极","categories":[{"name":"Others","slug":"Others","permalink":"http://hanunimaas.com/categories/Others/"}],"tags":[]}]}